#pragma once

namespace hand
{
	namespace Msg
	{
		constexpr std::array<StringView, 10> Data = {
			// 0-2: Main
			U"よくぞここまで\n\nけわしい道のりであったでしょう"_sv,
			U"では　すべてを受け入れ\n\n無限の夢から覚めるのです"_sv,
			U"…あるいは　望むならその手で\n\n運命を否定してみなさい"_sv,

			// 3-5: End 0
			U"ここは　目的地ではなかったのか？"_sv,
			U"「…帰らなきゃ」\n\nちからなくつぶやき、目を閉じた。"_sv,
			U"意識が遠のくなか\n\nあの場所を　思い出していた…"_sv,

			// 6-9: End 1
			U"ついに　なつかしいこの場所へ\n\nもどってこれた…"_sv,
			U"あのころの思い出がよみがえる…\n\nもう十分だと感じた。"_sv,
			U"すべてを受け入れたいま\n\nおもい残すことはない"_sv,
			U"その眼には　手を振る皆が映っていた…"_sv,
		};
	}
}
